Revit 2026 API

# DockablePaneState Methods

---

The DockablePaneState type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetFloatingRectangle | When %dockPosition% is Floating, sets the rectangle used to determine the size and position of the pane when %dockPosition% is Floating. Coordinates are relative to the upper-left-hand corner of the main Revit window. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

DockablePaneState Class

Autodesk.Revit.UI Namespace